app/views/cat_rental_requests/new.html.erb

        <option disabled selected>-- Please select a cat --</option>
        <% Cat.all.each do |cat|%>
---
SELECT "cats".* FROM "cats"