app/controllers/cat_rental_requests_controller.rb

    def create
        @request=CatRentalRequest.new(requests_params)
        if @request.save
---
INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cat_id", 4], ["start_date", "2020-01-01"], ["end_date", "2020-01-02"], ["created_at", "2020-01-09 21:01:13.796897"], ["updated_at", "2020-01-09 21:01:13.796897"]]

    def current_request
        @request ||=
          CatRentalRequest.includes(:cat).find(params[:id])
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 2]]