app/controllers/cats_controller.rb

    def create
        @cat = current_user.cats.new(cat_params)
        #@cat=Cat.new(cats_params)
        if @cat.save
---
INSERT INTO "cats" ("name", "birth_date", "color", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        @cat=Cat.find_by(id: params[:id])
        if @cat.update(cats_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "orange"], ["updated_at", "2020-01-09 04:37:38.305422"], ["id", 3]]