app/models/cat_rental_request.rb

    def approve!
            self.status="APPROVED"
            self.save!
            overlapping_pending_requests.each do |request|
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "APPROVED"], ["updated_at", "2020-01-09 20:58:15.035679"], ["id", 2]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2020-06-16' AND end_date < '2020-06-06') AND (status='PENDING')  [["id", 2], ["cat_id", 2]]

    def deny!
        self.status="DENIED"
        self.save!
---
UPDATE "cat_rental_requests" SET "status" = $1, "updated_at" = $2 WHERE "cat_rental_requests"."id" = $3  [["status", "DENIED"], ["updated_at", "2020-01-09 21:00:23.779306"], ["id", 3]]

    def does_not_overlap_approved_request
        if (self.status=="APPROVED"||self.status=="PENDING") && overlapping_approved_requests.exists?
---
SELECT 1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" != $1 AND "cat_rental_requests"."cat_id" = $2 AND NOT (start_date > '2020-06-16' AND end_date < '2020-06-06') AND (status= 'APPROVED') LIMIT $3  [["id", 2], ["cat_id", 2], ["LIMIT", 1]]